src/Catalogs/ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ИнформационныеБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизОбновления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РелизыОбновлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПоддержки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоддержки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКаталогИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сервера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогАрхива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксАрхива</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПерезаписыватьАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьБазуПослеОбновления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленаБлокировкаCеансов</Name>
					<Comment>Установлена блокировка сеансов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановленаБлокировкаРегламентныхЗаданий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняетсяОбработка</Name>
					<Comment>Используется для системных целей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обработчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверSQL</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сервера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогАрхиваSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБДSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбновления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбновлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьПроверкуСоответствияРелизов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантХраненияФайлаАрхиваВБазе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыХраненияАрхиваВБазе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВБазеСсылкиНаВнешниеФайлыАрхивов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереопределитьГлобальныеПараметрыДействийСАрхивами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РелизТехнологическойПлатформы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РелизыТехнологическойПлатформы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательХранилища</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеКонфигураций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сервера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодключениеКХранилищуПриЗапускеКонфигуратора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыИБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыИБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файловая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Серверная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыУчетныхЗаписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыУчетныхЗаписей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УчетнаяЗаписьИБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетнаяЗаписьСервера1С</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетнаяЗаписьSQL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетнаяЗаписьХранилищаКонфигураций</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИнформационныеБазы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
//
//
Процедура РелизОбновленияПриИзмененииСервер()
	Если ЗначениеЗаполнено(Объект.РелизОбновления) Тогда 
		Объект.ВидКонфигурации = Объект.РелизОбновления.ВидКонфигурации;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
//
//
Процедура УправлениеЭлементамиФормы()
	ТекущийОбъект = ЭтаФорма.Объект;
	
	ЭтоФайловаяБаза = (ТекущийОбъект.ТипИБ = ПредопределенноеЗначение("Перечисление.ТипыИБ.Файловая"));	
	Элементы.СерверИБ.Доступность = НЕ ЭтоФайловаяБаза;		
	Элементы.ИмяКаталогИБ.Заголовок = ?(ЭтоФайловаяБаза, "Каталог ИБ", "Имя ИБ");
	Элементы.ИмяКаталогИБ.КнопкаВыбора = ЭтоФайловаяБаза;
	Элементы.ИмяКаталогИБ.КнопкаОткрытия = ЭтоФайловаяБаза;
	Элементы.ПараметрыSQL.Видимость = НЕ ЭтоФайловаяБаза;
	
	Элементы.ХранитьВБазеСсылкиНаВнешниеФайлыАрхивов.Доступность = ТекущийОбъект.ПереопределитьГлобальныеПараметрыДействийСАрхивами;
	Элементы.ВариантХраненияФайлаАрхиваВБазе.Доступность = ТекущийОбъект.ПереопределитьГлобальныеПараметрыДействийСАрхивами;	
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ТипИБПриИзменении(Элемент)
	Объект.СерверИБ = "";
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
//
//
Процедура КаталогАрхиваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);		
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите каталог для выгрузки архивов";
	ДиалогВыбораКаталога.Каталог = ЭтаФорма.Объект.КаталогАрхива;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		ЭтаФорма.Объект.КаталогАрхива = ДиалогВыбораКаталога.Каталог;		
		ЭтаФорма.ОбновитьОтображениеДанных();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
//
//
Процедура КаталогАрхиваSQLНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);		
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите каталог для выгрузки архивов SQL";
	ДиалогВыбораКаталога.Каталог = ЭтаФорма.Объект.КаталогАрхива;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		ЭтаФорма.Объект.КаталогАрхива = ДиалогВыбораКаталога.Каталог;		
		ЭтаФорма.ОбновитьОтображениеДанных();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
//
//
Процедура ИмяКаталогИБНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);	
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;	
	ДиалогВыбораКаталога.Заголовок = "Выберите каталог ИБ";
	ДиалогВыбораКаталога.Каталог = ЭтаФорма.Объект.ИмяКаталогИБ;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		ЭтаФорма.Объект.ИмяКаталогИБ = ДиалогВыбораКаталога.Каталог;				
		ЭтаФорма.ОбновитьОтображениеДанных();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
//
//
Процедура РелизОбновленияПриИзменении(Элемент)
	РелизОбновленияПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
//
//
Процедура КаталогАрхиваОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ЭтаФорма.Объект.КаталогАрхива);
КонецПроцедуры

&НаКлиенте
Процедура КаталогАрхиваSQLОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ЭтаФорма.Объект.КаталогАрхиваSQL);
КонецПроцедуры

&НаКлиенте
//
//
Процедура ИмяКаталогИБОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(ЭтаФорма.Объект.ИмяКаталогИБ);
КонецПроцедуры

&НаКлиенте
//
//
Процедура УстановленаБлокировкаCеансовПриИзменении(Элемент)
	Если Объект.УстановленаБлокировкаCеансов = Истина Тогда 
		Объект.УстановленаБлокировкаCеансов = Ложь;
		ОбщегоНазначенияСервер.ВывестиСообщение("Устанавливать значение данного параметра в значение ИСТИНА в интерактивном режиме запрещено!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
//
//
Процедура ВыполняетсяОбработкаПриИзменении(Элемент)
	Если Объект.ВыполняетсяОбработка Тогда 
		Объект.ВыполняетсяОбработка = Ложь;
		ОбщегоНазначенияСервер.ВывестиСообщение("Устанавливать значение данного параметра в значение ИСТИНА в интерактивном режиме запрещено!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
//
//
Процедура ВыполнятьЗапускОбработкиОбновленияИБПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Обработчик) Тогда
		ОбщегоНазначенияСервер.ВывестиСообщение("Внимание! Включение данной опции может привести к не корректному выполнению процедуры обновления информационных баз!" 
		+ Символы.ПС + "Рекоммендуется устанавливать опцию только для типовых конфигураций, корректно обрабатывающих вызов:"
		+ Символы.ПС + ЗадачиНаСервере.ПолучитьЗначениеРеквизита(Объект.Обработчик, "КодОбработчика"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
//
//
Процедура УстановленаБлокировкаРегламентныхЗаданийПриИзменении(Элемент)
	Если Объект.УстановленаБлокировкаРегламентныхЗаданий = Истина Тогда 
		Объект.УстановленаБлокировкаРегламентныхЗаданий = Ложь;
		ОбщегоНазначенияСервер.ВывестиСообщение("Устанавливать значение данного параметра в значение ИСТИНА в интерактивном режиме запрещено!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ТипУчетнойЗаписи", ПредопределенноеЗначение("Перечисление.ТипыУчетныхЗаписей.УчетнаяЗаписьИБ"));
	
	ОткрытьФорму("Справочник.УчетныеЗаписи.ФормаВыбора", Новый Структура("Отбор", Отбор), ЭтаФорма,,,,
	Новый ОписаниеОповещения("ПользовательНачалоВыбораОписаниеОповещения", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПользовательНачалоВыбораОписаниеОповещения(РезультатОповещения, ПараметрыОповещения) Экспорт

	Если НЕ ЗначениеЗаполнено(РезультатОповещения) Тогда Возврат; КонецЕсли;
	
	Объект.Пользователь = РезультатОповещения;
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ОтключитьПроверкуСоответствияРелизовПриИзменении(Элемент)
	Если Объект.ОтключитьПроверкуСоответствияРелизов Тогда 		
		ОбщегоНазначенияСервер.ВывестиСообщение("Установка данного параметра отключает проверку соответствия релизов обновлений по UpdInfo.txt" + Символы.ПС + "Использование рекурсивной установки обновлений в данном режиме невозможно!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
//
//
Процедура ПереопределитьГлобальныеПараметрыДействийСАрзивамиПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическоеПодключениеКХранилищуПриЗапускеКонфигуратораПриИзменении(Элемент)
	Если Объект.АвтоматическоеПодключениеКХранилищуПриЗапускеКонфигуратора И НЕ ЗначениеЗаполнено(Объект.ХранилищеКонфигураций) Тогда
		Объект.АвтоматическоеПодключениеКХранилищуПриЗапускеКонфигуратора = Ложь;
		ПоказатьПредупреждение(, "Не заданы параметры подключения к хранилищу!", ,"Опция не может быть активирована");
	КонецЕсли;
КонецПроцедуры
